<?php
//1

/*//$i = 0;
while ($i <= 100) {
    if ($i % 3 === 0) {
        echo "$i <br>";
    }
    $i++;
}*/

//2

/*$i = 0;
do {
    if($i == 0){
        echo "$i - ноль<br>";
        $i++;
    }
    elseif($i % 2 == 0){
        echo "$i - чётное число <br>";
        $i++;
    }
    else{
        echo "$i - нечётное число<br>";
        $i++;
    }
    } while ($i <= 10);*/

//3

//$cities = [
//    "Московская область" =>
//        ["Москва", "Зеленоград", "Клин"],
//    "Ленинградская область" =>
//        ["Санкт-Петербург", "Всеволожск", "Павловск","Кронштадт"],
//    "Рязанская область" =>
//        ["Рязань", "Касимов", "Скопин","Сасово","Ряжск"]
//];
//
//foreach ($cities as $area => $city){
//    echo "<br>$area<br>";
//    echo implode(", ", $city);
//}

//4

/*$azb = ["a" => "a",
        "б" => "b",
        "в" => "v",
        "г" => "g",
        "д" => "d",
        "е" => "e",
        "ё" => "yo",
        "ж" => "zh",
        "з" => "z",
        "и" => "i",
        "к" => "k",
        "л" => "l",
        "м" => "m",
        "н" => "n",
        "о" => "o",
        "п" => "p",
        "р" => "r",
        "с" => "s",
        "т" => "t",
        "у" => "u",
        "ф" => "f",
        "х" => "h",
        "ц" => "c",
        "ч" => "ch",
        "ш" => "sh",
        "щ" => "sh",
        "ы" => "i",
        "э" => "e",
        "ю" => "yu",
        "я" => "ya"
    ];*/



//5 Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.

/*$test = "Здесь два пробела";

$bodytag = str_replace(" ", "_", $test);

echo $bodytag;*/


//6 Не сделал

//7
/*for ($i = 1; print $i, $i++ < 10;);*/

//8 Не сделал


//9 Не сделал


?>


